#include <iostream>
using namespace std;

int main() {
	do {
		//Авторизоваться или зарегестрироваться
		// Ввод логина и пароля
		// выбор кому отправить
		// отправка сообщения
		// либо выход из аккаунта либо отправить кому то ещё
		// или отправить всем

		//Структура
		// класс сообщение
		// класс юзер
		// класс чат
		// 
		// Методы
		// регистрация и авторизация
		// отправка сообщения
		// 
		// 
		// Добрый вечер! Вам нужно создать классы минимум для сообщений, юзеров и чата. 
		// Методы в юзерах - регистрация и авторизация. 
		// В сообщениях можно разделить персональные личные. 
		// Базы данных тут не нужны. 
		// Всё работает пока запущено приложение. 
		// Дать возможность логиниться под разными юзерами, которых заведете. 
		// Все хранить в динамических массивах.  
		// Примерно так. Будут вопросы пишите.
		// 
		// Должно запускаться на одном компе, и общение должно быть в терминале не выходя из него
		// 
		// 
		//
	}
}